  
&НаСервере
Функция Остатки(счет)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто1,
		|	ХозрасчетныйОстатки.Счет,
		|	ХозрасчетныйОстатки.СуммаОстатокДт,
		|	ХозрасчетныйОстатки.СуммаОстатокКт,
		|	ХозрасчетныйОстатки.Субконто2,
		|	ХозрасчетныйОстатки.Субконто3
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаКон, , , ) КАК ХозрасчетныйОстатки
		|ГДЕ
		|	ХозрасчетныйОстатки.Счет = &Счет";
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос.Текст = Запрос.Текст + 
			" И ХозрасчетныйОстатки.Субконто1 = &Контр";
		Запрос.УстановитьПараметр("Контр", Контрагент);
	КонецЕсли;
	ДатаКонцаМесяцаГраница = Новый Граница(КонецДня(Дата), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("Счет", Счет);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКонцаМесяцаГраница);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат(Результат);
КонецФункции


&НаСервере
Функция ПолучитьМакетНаСервере() Экспорт
	
	НДС20 = Истина;
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("Отчет");
	ТабДок = Новый ТабличныйДокумент;
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаСчетов = Макет.ПолучитьОбласть("ШапкаСчетов");
	ОбластьНаименование = Макет.ПолучитьОбласть("Наименование");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.Вывести(ОбластьШапкаСчетов);
	ТабДок.Вывести(ОбластьНаименование);
	
	Ном1 = 0;
	
	Счет = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.02");
	РезОстатки62_02 = Остатки(Счет);
	Счет = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.АВ");
	РезОстатки76_АВ = Остатки(Счет);
	
	//Обработка остатков 62.02 (создание СФ на аванс)
	Для Каждого Стр Из РезОстатки62_02 Цикл
		
		Попытка
			Если НЕ ЗначениеЗаполнено(Стр.Субконто3) Тогда
				Сообщить("" + Стр.Субконто1 + " Не заполнен документ по субконто3");
			КонецЕсли;
			
			Если Стр.СуммаостатокКт <> 0 Тогда
				Если НДС20 И Стр.Субконто3.Дата >= Дата(2026,01,01,0,0,0) Тогда
					Ндс = Окр(Стр.СуммаостатокКт * 22 / 122, 2);
				Иначе
					Ндс = Окр(Стр.СуммаостатокКт * 20 / 120, 2);
				КонецЕсли;
			Иначе
				Ндс = 0;
			КонецЕсли;
			
			Отбор = Новый Структура;
			Отбор.Вставить("Субконто1", Стр.Субконто1);
			Отбор.Вставить("Субконто2", Стр.Субконто3);
			НайденныеСтроки = РезОстатки76_АВ.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда
				Рез76 = 0;
			Иначе
				Рез76 = НайденныеСтроки[0].СуммаОстатокДт;
				Если НайденныеСтроки.Количество() > 1 Тогда
					Сообщить("Косяк");
				КонецЕсли;
			КонецЕсли;
			
			Если Ндс = Рез76 Тогда
				Продолжить;
			КонецЕсли;
			Если (Ндс - Рез76) > 0 И (Ндс - Рез76) < 0.05 Тогда
				Продолжить;
			КонецЕсли;
			Если (Рез76 - НДС) > 0 И (Рез76 - НДС) < 0.05 Тогда
				Продолжить;
			КонецЕсли;
			
			Если Ндс > Рез76 Тогда
				Если ТипЗнч(Стр.Субконто3) = Тип("ДокументСсылка.КорректировкаДолга") Тогда
					ДокСФВыд = Документы.СчетФактураВыданный.СоздатьДокумент();
					ДокСФВыд.Дата = Стр.Субконто3.Дата;
					ДокСФВыд.Организация = Справочники.Организации.НайтиПоКоду("00-000001");
					ДокСФВыд.Контрагент = Стр.Субконто1;
					ДокСФВыд.ДоговорКонтрагента = Стр.Субконто2;
					ДокСФВыд.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс;
					ДокСФВыд.КодВидаОперации = "02";
					ДокСФВыд.Выставлен = Истина;
					ДокСФВыд.ДатаВыставления = Стр.Субконто3.Дата;
					ДокСФВыд.КодСпособаВыставления = 1;
					ДокСФВыд.Ответственный = ПараметрыСеанса.ТекущийПользователь;
					ДокСФВыд.ГлавныйБухгалтер = ПараметрыСеанса.ТекущийПользователь;
					ДокСФВыд.Руководитель = ПараметрыСеанса.ТекущийПользователь;
					ДокСФВыд.Комментарий = "Создан обработкой";
					ДокСФВыд.Сумма = Стр.СуммаостатокКт;
					ДокСФВыд.СуммаДокумента = Стр.СуммаостатокКт;
					Если НДС20 И Стр.Субконто3.Дата >= Дата(2026,01,01,0,0,0) Тогда
						ДокСФВыд.СуммаНДСДокумента = Стр.СуммаостатокКт * 22 / 122;
					Иначе
						ДокСФВыд.СуммаНДСДокумента = Стр.СуммаостатокКт * 20 / 120;
					КонецЕсли;
					ДокСФВыд.ВалютаДокумента = Стр.Субконто2.ВалютаВзаиморасчетов;
					
					НоваяСтрокаДокОсн = ДокСФВыд.ДокументыОснования.Добавить();
					НоваяСтрокаДокОсн.ДокументОснование = Стр.Субконто3;
					
					НовСтрока = ДокСФВыд.Авансы.Добавить();
					НовСтрока.Сумма = Стр.СуммаостатокКт;
					Если НДС20 И Стр.Субконто3.Дата >= Дата(2026,01,01,0,0,0) Тогда
						НовСтрока.СуммаНДС = Стр.СуммаостатокКт * 22 / 122;
						НовСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС22_122;
					Иначе
						НовСтрока.СуммаНДС = Стр.СуммаостатокКт * 20 / 120;
						НовСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120;
					КонецЕсли;
					ДокСФВыд.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	КорректировкаДолга.Ссылка
						|ИЗ
						|	Документ.КорректировкаДолга КАК КорректировкаДолга
						|ГДЕ
						|	КорректировкаДолга.Ссылка.Проведен
						|	И КорректировкаДолга.Ссылка.КонтрагентКредитор = &КонтрагентКредитор
						|	И КорректировкаДолга.Ссылка.Дата <= &Дата";
					Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
					Запрос.УстановитьПараметр("КонтрагентКредитор", Стр.Субконто1);
					Запрос.УстановитьПараметр("ДоговорКонтрагента", Стр.Субконто2);
					РезультатЗапроса = Запрос.Выполнить().Выгрузить();
				КонецЕсли;
			ИначеЕсли Ндс < Рез76 Тогда
				Продолжить;
			КонецЕсли;
			
		Исключение
			Сообщить("ОШИБКА при обработке остатков 62.02:" + Символы.ПС +
				"Контрагент: " + Стр.Субконто1 + Символы.ПС +
				"Документ (субконто3): " + Стр.Субконто3 + Символы.ПС +
				"Договор (субконто2): " + Стр.Субконто2 + Символы.ПС +
				"Сумма остаток Кт: " + Стр.СуммаостатокКт + Символы.ПС +
				"Текст ошибки: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	//Обработка остатков 76.АВ (обратная сверка)
	Счет = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.02");
	РезОстатки62_02 = Остатки(Счет);
	Счет = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.АВ");
	РезОстатки76_АВ = Остатки(Счет);
	
	Для Каждого Стр Из РезОстатки76_АВ Цикл
		
		Попытка
			Если Стр.СуммаостатокДт <> 0 Тогда
				Рез76 = Стр.СуммаОстатокДт;
			Иначе
				Рез76 = 0;
			КонецЕсли;
			
			Отбор = Новый Структура;
			Отбор.Вставить("Субконто1", Стр.Субконто1);
			Отбор.Вставить("Субконто3", Стр.Субконто2);
			НайденныеСтроки = РезОстатки62_02.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда
				Ндс = 0;
			Иначе
				Если НДС20 И Стр.Субконто2.Дата >= Дата(2026,01,01,0,0,0) Тогда
					Ндс = Окр(НайденныеСтроки[0].СуммаостатокКт * 22 / 122, 2);
				Иначе
					Ндс = Окр(НайденныеСтроки[0].СуммаостатокКт * 20 / 120, 2);
				КонецЕсли;
				Если НайденныеСтроки.Количество() > 1 Тогда
					Сообщить("Косяк");
				КонецЕсли;
			КонецЕсли;
			Если Ндс < Рез76 Тогда
			//Расхождение — будет выведено в отчёт ниже
			КонецЕсли;
			
		Исключение
			Сообщить("ОШИБКА при обработке остатков 76.АВ:" + Символы.ПС +
				"Контрагент: " + Стр.Субконто1 + Символы.ПС +
				"Документ (субконто2): " + Стр.Субконто2 + Символы.ПС +
				"Сумма остаток Дт: " + Стр.СуммаостатокДт + Символы.ПС +
				"Текст ошибки: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	//Формирование отчёта — вывод строк из 62.02
	СписокДок = Новый СписокЗначений;
	Счет = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.02");
	РезОстатки62_02 = Остатки(Счет);
	Счет = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.АВ");
	РезОстатки76_АВ = Остатки(Счет);
	
	Для Каждого Стр Из РезОстатки62_02 Цикл
		
		Попытка
			Если РезОстатки62_02.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если Стр.СуммаостатокКт <> 0 Тогда
				Если НДС20 И Стр.Субконто3.Дата >= Дата(2026,01,01,0,0,0) Тогда
					Ндс = Окр(Стр.СуммаостатокКт * 22 / 122, 2);
				Иначе
					Ндс = Окр(Стр.СуммаостатокКт * 20 / 120, 2);
				КонецЕсли;
			Иначе
				Ндс = 0;
			КонецЕсли;
			
			Отбор = Новый Структура;
			Отбор.Вставить("Субконто1", Стр.Субконто1);
			Отбор.Вставить("Субконто2", Стр.Субконто3);
			НайденныеСтроки = РезОстатки76_АВ.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда
				Рез76 = 0;
			Иначе
				Рез76 = НайденныеСтроки[0].СуммаОстатокДт;
				Если НайденныеСтроки.Количество() > 1 Тогда
					Сообщить("Косяк");
				КонецЕсли;
			КонецЕсли;
			Если Ндс = Рез76 Тогда
				Продолжить;
			КонецЕсли;
			Если (Ндс - Рез76) > 0 И (Ндс - Рез76) < 0.05 Тогда
				Продолжить;
			КонецЕсли;
			Если (Рез76 - НДС) > 0 И (Рез76 - НДС) < 0.05 Тогда
				Продолжить;
			КонецЕсли;
			
			Ном1 = Ном1 + 1;
			
			ОбластьСтрока.Параметры.Ном1 = Ном1;
			ОбластьСтрока.Параметры.Документ1 = Стр.Субконто3;
			ОбластьСтрока.Параметры.Контрагент1 = Стр.Субконто1;
			ОбластьСтрока.Параметры.Сумма1 = Ндс;
			ОбластьСтрока.Параметры.Сумма2 = Рез76;
			ТабДок.Вывести(ОбластьСтрока);
			СписокДок.Добавить(Стр.Субконто3);
			
		Исключение
			Сообщить("ОШИБКА при формировании отчёта (строка 62.02):" + Символы.ПС +
				"Контрагент: " + Стр.Субконто1 + Символы.ПС +
				"Документ (субконто3): " + Стр.Субконто3 + Символы.ПС +
				"Договор (субконто2): " + Стр.Субконто2 + Символы.ПС +
				"Сумма остаток Кт: " + Стр.СуммаостатокКт + Символы.ПС +
				"Текст ошибки: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
		
	//Формирование отчёта — вывод строк из 76.АВ
	Для Каждого Стр Из РезОстатки76_АВ Цикл
		
		Попытка
			Если СписокДок.НайтиПоЗначению(Стр.Субконто2) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если Стр.СуммаостатокДт <> 0 Тогда
				Рез76 = Стр.СуммаОстатокДт;
			Иначе
				Рез76 = 0;
			КонецЕсли;
			
			Отбор = Новый Структура;
			Отбор.Вставить("Субконто1", Стр.Субконто1);
			Отбор.Вставить("Субконто3", Стр.Субконто2);
			НайденныеСтроки = РезОстатки62_02.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда
				Ндс = 0;
			Иначе
				Если НДС20 И Стр.Субконто2.Дата >= Дата(2026,01,01,0,0,0) Тогда
					Ндс = Окр(НайденныеСтроки[0].СуммаостатокКт * 22 / 122, 2);
				Иначе
					Ндс = Окр(НайденныеСтроки[0].СуммаостатокКт * 20 / 120, 2);
				КонецЕсли;
				Если НайденныеСтроки.Количество() > 1 Тогда
					Сообщить("Косяк");
				КонецЕсли;
			КонецЕсли;
			Если Ндс = Рез76 Тогда
				Продолжить;
			КонецЕсли;
			Если (Ндс - Рез76) > 0 И (Ндс - Рез76) < 0.05 Тогда
				Продолжить;
			КонецЕсли;
			Если (Рез76 - НДС) > 0 И (Рез76 - НДС) < 0.05 Тогда
				Продолжить;
			КонецЕсли;
			
			Ном1 = Ном1 + 1;
			
			ОбластьСтрока.Параметры.Ном1 = Ном1;
			ОбластьСтрока.Параметры.Документ1 = Стр.Субконто2;
			ОбластьСтрока.Параметры.Контрагент1 = Стр.Субконто1;
			ОбластьСтрока.Параметры.Сумма1 = Ндс;
			ОбластьСтрока.Параметры.Сумма2 = Рез76;
			ТабДок.Вывести(ОбластьСтрока);
			
		Исключение
			Сообщить("ОШИБКА при формировании отчёта (строка 76.АВ):" + Символы.ПС +
				"Контрагент: " + Стр.Субконто1 + Символы.ПС +
				"Документ (субконто2): " + Стр.Субконто2 + Символы.ПС +
				"Сумма остаток Дт: " + Стр.СуммаостатокДт + Символы.ПС +
				"Текст ошибки: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	//ФИНАЛИЗАЦИЯ ОТЧЁТА
	Попытка
		ТабДок.ОтображатьЗаголовки = Ложь;
		ТабДок.ОтображатьСетку = Ложь;
		ТабДок.ТолькоПросмотр = Истина;
		ТабДок.СохранятьСвойстваОтображения = Истина;
		ТабДок.ФиксацияСверху = 5;
	Исключение
		Сообщить("ОШИБКА при настройке табличного документа:" + Символы.ПС +
			"Текст ошибки: " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ТабДок;
	
КонецФункции


&НаКлиенте
Процедура ПолучитьМакетНаСервер(Команда)
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Сообщить("Не указана дата");
		Возврат;
	КонецЕсли;
	
	Попытка
		ТабДок = ПолучитьМакетНаСервере();
		ТабДок.Показать();
	Исключение
		Сообщить("ОШИБКА при формировании отчёта на клиенте:" + Символы.ПС +
			"Текст ошибки: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры


&НаСервере
Процедура ПриОткрытии()
	Толькоотчет = Истина;
	НДС20 = Истина;
КонецПроцедуры


Процедура ПоконрагентуНажатие(Элемент)
	
	Попытка
		Для К = 1 По 2 Цикл
			Если К = 1 Тогда
				Счет = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.02");
			ИначеЕсли К = 2 Тогда
				Счет = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.АВ");
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ХозрасчетныйОстатки.Субконто1,
				|	ХозрасчетныйОстатки.Счет,
				|	ХозрасчетныйОстатки.СуммаОстатокДт,
				|	ХозрасчетныйОстатки.СуммаОстатокКт,
				|	ХозрасчетныйОстатки.Субконто2,
				|	ХозрасчетныйОстатки.Субконто3
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаКон, , , ) КАК ХозрасчетныйОстатки
				|ГДЕ
				|	ХозрасчетныйОстатки.Субконто1 = &Контрагент
				|	И ХозрасчетныйОстатки.Счет = &Счет";
			
			ДатаКонцаМесяцаГраница = Новый Граница(КонецДня(Дата), ВидГраницы.Включая);
			Запрос.УстановитьПараметр("Счет", Счет);
			Запрос.УстановитьПараметр("ДатаКон", ДатаКонцаМесяцаГраница);
			Запрос.УстановитьПараметр("Контрагент", Контрагент);
			Результат = Запрос.Выполнить().Выгрузить();
			
			Для Каждого Стр Из Результат Цикл
				Попытка
					Если К = 1 Тогда
						Если НДС20 И Стр.Субконто3.Дата >= Дата(2026,01,01,0,0,0) Тогда
							Сообщить("62.2 " + Стр.Субконто3 + " Ндс=" + Стр.СуммаОстатокКт * 22 / 122);
						Иначе
							Сообщить("62.2 " + Стр.Субконто3 + " Ндс=" + Стр.СуммаОстатокКт * 20 / 120);
						КонецЕсли;
					ИначеЕсли К = 2 Тогда
						Сообщить("76.АВ " + Стр.Субконто2 + " Ндс=" + Стр.СуммаОстатокДт);
					КонецЕсли;
				Исключение
					Сообщить("ОШИБКА в ПоконрагентуНажатие:" + Символы.ПС +
						"Счёт: " + ?(К = 1, "62.02", "76.АВ") + Символы.ПС +
						"Контрагент: " + Стр.Субконто1 + Символы.ПС +
						"Субконто2: " + Стр.Субконто2 + Символы.ПС +
						"Субконто3: " + Стр.Субконто3 + Символы.ПС +
						"Текст ошибки: " + ОписаниеОшибки());
				КонецПопытки;
			КонецЦикла;
		КонецЦикла;
		
	Исключение
		Сообщить("КРИТИЧЕСКАЯ ОШИБКА в ПоконрагентуНажатие:" + Символы.ПС +
			"Текст ошибки: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры
  
  
  
  
  
