
Процедура ОбработкаПроведения(Отказ, Режим)

	
	// при отсутствии табличных частей, документ не проводим
	Если Номенклатура.Количество() = 0 Тогда		
		Сообщить("Не заполнена табличная часть");
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
	
	// регистр ОстаткиМатериалов Приход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаНоменклатура Из Номенклатура Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Номенклатура = ТекСтрокаНоменклатура.Номенклатура;
		Движение.Количество = ТекСтрокаНоменклатура.Количество;
	КонецЦикла;

КонецПроцедуры
