&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент)   
	
	Возраст = Цел((ТекущаяДата() - ДатаРождения) / 31536000);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НаличиеДетей = Ложь Тогда
		Элементы.КоличествоДетей.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаличиеДетейПриИзменении(Элемент)
	
	Если НаличиеДетей = Истина Тогда
		Элементы.КоличествоДетей.Видимость = Истина;
	Иначе 
		Элементы.КоличествоДетей.Видимость = Ложь;  
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(КоличествоДетей) Тогда
	    Элементы.КоличествоДетей.Видимость = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоПервоеМестоРаботыПриИзменении(Элемент)
	
	Если ЭтоПервоеМестоРаботы = Истина Тогда	
		Элементы.МестоРаботыДолжность.Доступность = Ложь;  		
		Элементы.МестоРаботыМестоРаботы.Доступность = Ложь	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МестоРаботыДатаОкончанияРаботыПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.МестоРаботы.ТекущиеДанные;
	Если ТекущаяСтрока.ДатаОкончанияРаботы <= ТекущаяСтрока.ДатаНачалаРаботы Тогда
	    Сообщить("Дата окончания не может быть равной или меньше даты начала. Введите новую дату!");
		
		ТекущаяСтрока.ДатаОкончанияРаботы = Дата("00010101");	
	КонецЕсли;
	
КонецПроцедуры


