
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// для повторного перепроведения документа, пустые наборы записей, чтобы читать взаиморасчеты без учета данных в документе
	Движения.Взаиморасчеты.Очистить();
	Движения.Взаиморасчеты.Записать();
	Движения.Управленческий.Записывать = Истина;

	
	// при отсутствии табличных частей, документ не проводим 
	Если Товар.Количество() = 0 И Услуга.Количество() = 0 Тогда	
		Сообщить("Не заполнена табличная часть");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

		
	// для проверки предоплаты	
	Если (ЛимитыСервер.ПолучитьЗадолженностьКонтрагента(Дата, Контрагент)*-1) < СуммаПоДокументу  И 
		//ЛимитыСервер.ПолучитьЗадолженностьКонтрагента(Дата, Контрагент) >= 0
		ЛимитыСервер.ПолучитьКредитныйЛимитКонтрагента(Дата, Контрагент) = Ложь	
		Тогда 
		Сообщить("Внимание! Предоплаты за товар нет.");
		Отказ = Истина;
	КонецЕсли;

		
	// для проверки кредитного лимита
	Если ЛимитыСервер.ПолучитьКредитныйЛимитКонтрагента(Дата, Контрагент) > 0 Тогда
		
		КредитныйЛимит = ЛимитыСервер.ПолучитьКредитныйЛимитКонтрагента(Дата, Контрагент);
		СуммаЗадолженности = ЛимитыСервер.ПолучитьЗадолженностьКонтрагента(Дата, Контрагент);
		СвободныйОстаток = КредитныйЛимит - СуммаЗадолженности;
		СуммаДокумента = Товар.Итог("Сумма") + Услуга.Итог("Сумма");
		
		Если СуммаДокумента > СвободныйОстаток Тогда
			Сообщить("Внимание! Превышен кредитный лимит.");
			Отказ = Истина;		
		КонецЕсли;	
	КонецЕсли;

	
	// для проверки срока кредита в реализации
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КредитныеЛимитыСрезПоследних.Контрагент КАК Контрагент,
	               |	КредитныеЛимитыСрезПоследних.ДатаВозврата КАК ДатаВозврата
	               |ИЗ
	               |	РегистрСведений.КредитныеЛимиты.СрезПоследних(&Дата, Контрагент = &Контрагент) КАК КредитныеЛимитыСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ДатаВозврата = Истина Тогда
		Иначе  Кредит = (ТекущаяДата() - ВыборкаДетальныеЗаписи.ДатаВозврата) / (60 * 60 * 24) - 1;      
			Если Кредит >= 0 Тогда
				Сообщить("Срок кредита истек.");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
		
	// проверка за счет чего будет реализация, предоплаты или кредита для подстановки документа-регистратора в регистр взаиморасчеты 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходнаяНакладная.Контрагент КАК Контрагент,
	               |	РасходнаяНакладная.СуммаПоДокументу КАК Сумма,
	               |	ВзаиморасчетыОстатки.Накладная КАК Накладная,
	               |	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ЕСТЬNULL(ВзаиморасчетыОстатки.Накладная.Дата, &ТекДата) КАК ДатаПервойНакладной,
	               |	ЕСТЬNULL(ВзаиморасчетыОстаткиПредоплата.СуммаОстаток, 0) КАК Предоплата
	               |ИЗ
	               |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Взаиморасчеты.Остатки(
	               |				&Период,
	               |				Контрагент = &Контрагент
	               |					И Накладная <> ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) КАК ВзаиморасчетыОстатки
	               |		ПО РасходнаяНакладная.Контрагент = ВзаиморасчетыОстатки.Контрагент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Взаиморасчеты.Остатки(
	               |				&Период,
	               |				Контрагент = &Контрагент
	               |					И Накладная = ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) КАК ВзаиморасчетыОстаткиПредоплата
	               |		ПО РасходнаяНакладная.Контрагент = ВзаиморасчетыОстаткиПредоплата.Контрагент
	               |ГДЕ
	               |	РасходнаяНакладная.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаПервойНакладной
	               |ИТОГИ
	               |	МАКСИМУМ(Сумма),
	               |	СУММА(СуммаОстаток),
	               |	МИНИМУМ(ДатаПервойНакладной),
	               |	СУММА(Предоплата)
	               |ПО
	               |	Контрагент";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Период", МоментВремени());
	Запрос.УстановитьПараметр("ТекДата", Дата);
	ВыборкаКонтрагенты = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКонтрагенты.Следующий();  	
	
	// регистр Взаиморасчеты Приход  
	Движения.Взаиморасчеты.Записывать = Истина;	
	Если Не Отказ Тогда
	ОсталосьОтгрузить = ВыборкаКонтрагенты.Сумма;   
			
		// если реализация за счет кредита
		Если  ОсталосьОтгрузить > 0 Тогда
			Движение = Движения.Взаиморасчеты.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Сумма = Мин(ОсталосьОтгрузить - (ВыборкаКонтрагенты.Предоплата * -1), ОсталосьОтгрузить);
			Движение.Накладная = Ссылка;	
		КонецЕсли; 
		
		// если реализация за счет предоплаты
		Если ВыборкаКонтрагенты.Предоплата < 0 И ОсталосьОтгрузить <= (ВыборкаКонтрагенты.Предоплата * -1) Тогда
			Движение = Движения.Взаиморасчеты.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Сумма = ОсталосьОтгрузить; 
			Движение.Накладная = ПредопределенноеЗначение("Документ.РасходнаяНакладная.ПустаяСсылка");
		КонецЕсли;
		
		//если реализация за счет предоплаты и кредита  
		Если ВыборкаКонтрагенты.Предоплата < 0 И ОсталосьОтгрузить > (ВыборкаКонтрагенты.Предоплата * -1) Тогда
			Движение = Движения.Взаиморасчеты.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Сумма = (ВыборкаКонтрагенты.Предоплата * -1); 
			Движение.Накладная = ПредопределенноеЗначение("Документ.РасходнаяНакладная.ПустаяСсылка");
		КонецЕсли;		
	КонецЕсли;
  
	// для повторного перепроведения документа, пустые наборы записей, чтобы читать остатки без учета данных в документе
	Движения.Остатки.Очистить();
	Движения.Остатки.Записать(); 
	
	// регистр Остатки Расход
	Движения.Остатки.Записывать = Истина; 
	
    // сворачиваем по общей номенклатуре в регистр Остатки (первый запрос)
	// расчитываем себестоимость по среднему (второй запрос)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходнаяНакладнаяТовар.Товар КАК Товар,
	               |	СУММА(РасходнаяНакладнаяТовар.Количество) КАК Количество,
	               |	СУММА(РасходнаяНакладнаяТовар.Сумма) КАК Сумма,
	               |	РасходнаяНакладная.Склад КАК Склад,
	               |	РасходнаяНакладная.Мастер КАК Мастер
	               |ПОМЕСТИТЬ втДанныеДокумента
	               |ИЗ
	               |	Документ.РасходнаяНакладная.Товар КАК РасходнаяНакладнаяТовар
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	               |		ПО РасходнаяНакладнаяТовар.Ссылка = РасходнаяНакладная.Ссылка
	               |ГДЕ
	               |	РасходнаяНакладнаяТовар.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходнаяНакладнаяТовар.Товар,
	               |	РасходнаяНакладная.Склад,
	               |	РасходнаяНакладная.Мастер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДанныеДокумента.Товар КАК Товар,
	               |	втДанныеДокумента.Количество КАК Количество,
	               |	втДанныеДокумента.Сумма КАК Сумма,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ОстаткиОстатки.КоличествоОстаток, 0) >= втДанныеДокумента.Количество
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ДостаточноОстатков,
	               |	ВЫБОР
	               |		КОГДА втДанныеДокумента.Количество = ЕСТЬNULL(ОстаткиОстатки.КоличествоОстаток, 0)
	               |			ТОГДА ЕСТЬNULL(ОстаткиОстатки.СуммаОстаток, 0)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ЕСТЬNULL(ОстаткиОстатки.КоличествоОстаток, 0) = 0
	               |					ТОГДА 0
	               |				ИНАЧЕ ЕСТЬNULL(ОстаткиОстатки.СуммаОстаток, 0) / ЕСТЬNULL(ОстаткиОстатки.КоличествоОстаток, 0) * втДанныеДокумента.Количество
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СтоимостьЕдиницы,
	               |	втДанныеДокумента.Товар.Представление КАК ТоварПредставление,
	               |	ОстаткиОстатки.Склад КАК Склад
	               |ИЗ
	               |	втДанныеДокумента КАК втДанныеДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Остатки.Остатки(
	               |				&МоментВремени,
	               |				Товар В
	               |					(ВЫБРАТЬ
	               |						втДанныеДокумента.Товар КАК Товар
	               |					ИЗ
	               |						втДанныеДокумента КАК втДанныеДокумента)) КАК ОстаткиОстатки
	               |		ПО втДанныеДокумента.Товар = ОстаткиОстатки.Товар";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	
	// если не достаточно остатков
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НЕ ВыборкаДетальныеЗаписи.ДостаточноОстатков Тогда
			Сообщить("Недостаточно товара " + ВыборкаДетальныеЗаписи.ТоварПредставление);
			Отказ = Истина;	
		КонецЕсли;
	КонецЦикла;
	
	Если Не Отказ Тогда  
		
		// формируем данные по регистру Остатки	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		 
		Пока  ВыборкаДетальныеЗаписи.Следующий() Цикл	
			Движение = Движения.Остатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Товар = ВыборкаДетальныеЗаписи.Товар;  
			Движение.Склад = ВыборкаДетальныеЗаписи.Склад;
			Движение.Количество = ВыборкаДетальныеЗаписи.Количество; 
			Движение.Сумма = ВыборкаДетальныеЗаписи.СтоимостьЕдиницы;   
			
			// Регистр бухгалтерии Управленческий
			//Первая проводка Дт 62 Кт 90.01
			//Для Каждого ТекСтрокаТовар из Товар Цикл    //ДОДЕЛАТЬ
				Движение = Движения.Управленческий.Добавить();
				Движение.СчетДт = ПланыСчетов.Основной.РасчетыСПокупателями;
				Движение.СчетКт = ПланыСчетов.Основной.Выручка;
				Движение.Период = Дата;
				Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;			
				Движение.СубконтодТ[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;    
				Движение.Содержание = "Реализация товаров";
			//КонецЦикла;
								
			//Вторая проводка Дт 90.02 Кт 41.01 
			Движение = Движения.Управленческий.Добавить();
			Движение.СчетДт = ПланыСчетов.Основной.Себестоимость;  
			Движение.СчетКт = ПланыСчетов.Основной.Товары; 
			Движение.Период = Дата; 
			Движение.Сумма = ВыборкаДетальныеЗаписи.СтоимостьЕдиницы;
			Движение.КоличествоКт = ВыборкаДетальныеЗаписи.Количество;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.ТоварыИУслуги] = ВыборкаДетальныеЗаписи.Товар;
			Движение.Содержание = "Списание товаров";
					
		КонецЦикла;	
		//Третья проводка Дт 62 Кт 90.01 услуги (из цикла убрала, иначе двоит)
		Если Услуга.Итог("Сумма") > 0 Тогда
			Движение = Движения.Управленческий.Добавить();
			Движение.СчетДт = ПланыСчетов.Основной.РасчетыСПокупателями;
			Движение.СчетКт = ПланыСчетов.Основной.Выручка;
			Движение.Период = Дата;
			Движение.Сумма = Услуга.Итог("Сумма");			
			Движение.СубконтодТ[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;		  
			Движение.Содержание = "Реализация услуг";
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// для автоматического заполнения реквизита СуммаПоДокументу
	СуммаТЧТовар = 0;
	Для Каждого СтрТабЧасти Из Товар Цикл
		СуммаТЧТовар = СуммаТЧТовар + СтрТабЧасти.Сумма;
	КонецЦикла;
	
	СуммаТЧУслуга = 0;
	Для Каждого СтрТабЧасти Из Услуга Цикл 
		СуммаТЧУслуга = СуммаТЧУслуга + СтрТабЧасти.Сумма;		
	КонецЦикла;
	
	СуммаПоДокументу = СуммаТЧТовар + СуммаТЧУслуга;
	
КонецПроцедуры

