
&НаКлиенте
Процедура ПриИзмененииТЧ(Элемент)  // расчет суммы
	
	СтрокаТабличнойЧасти = Элементы.Товар.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииТЧУ(Элемент)  // расчет суммы
	
	СтрокаТабличнойЧасти = Элементы.Услуга.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварТоварПриИзменении(Элемент) // автоматическое проставление цены на товары
	
	// Получим текущую строку табличной части Товар
	СтрокаТабличнойЧасти = Элементы.Товар.ТекущиеДанные; 
	
	// Установим цену
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(
	Объект.Дата, СтрокаТабличнойЧасти.Товар);
		
КонецПроцедуры

&НаКлиенте
Процедура УслугаУслугаПриИзменении(Элемент)  // автоматическое прставление цены на услуги
	
	// Получим текущую строку табличной части Услуга
	СтрокаТабличнойЧасти = Элементы.Услуга.ТекущиеДанные;  
	
	// Установим цену
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(
	Объект.Дата, СтрокаТабличнойЧасти.Услуга);
	
КонецПроцедуры
