
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Взаиморасчеты.Записать();  
	Движения.Управленческий.Записывать = Истина;
	
	
	// проверка поступления денежных средств - погашение кредита, либо предоплата, для постановки документа в регистр Взаиморасчеты
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыОстатки.Накладная КАК Накладная,
	               |	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ПриходДС.Контрагент КАК Контрагент,
	               |	ПриходДС.Сумма КАК Сумма
	               |ИЗ
	               |	Документ.ПриходДС КАК ПриходДС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Взаиморасчеты.Остатки(&Дата, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки
	               |		ПО ПриходДС.Контрагент = ВзаиморасчетыОстатки.Контрагент
	               |ГДЕ
	               |	ПриходДС.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВзаиморасчетыОстатки.Накладная.Дата
	               |ИТОГИ
	               |	СУММА(СуммаОстаток),
	               |	МАКСИМУМ(Сумма)
	               |ПО
	               |	Контрагент";
	
	Запрос.УстановитьПараметр("Дата", МоментВремени());
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКонтрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКонтрагент.Следующий();
	
	ОсталосьПогасить = ВыборкаКонтрагент.Сумма; 
	Выборка = ВыборкаКонтрагент.Выбрать();
	
	Пока Выборка.Следующий() И ОсталосьПогасить > 0 Цикл 	
		Если ОсталосьПогасить > Выборка.СуммаОстаток Тогда 	
			Погасить = Выборка.СуммаОстаток;
			ОсталосьПогасить = ОсталосьПогасить - Погасить;  
		Иначе 
			Погасить = ОсталосьПогасить;
			ОсталосьПогасить = 0;	
		КонецЕсли;
			
		//регистр Взаиморасчеты Расход
		Движение = Движения.Взаиморасчеты.ДобавитьРасход();	
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент; 
		Движение.Накладная = Выборка.Накладная; 
		Движение.Сумма = Погасить;   
		
		// Регистр бухгалтерии Управленческий
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.Касса;
		Движение.СчетКт = ПланыСчетов.Основной.РасчетыСПокупателями;
		Движение.Период = Дата;
		Движение.Сумма = Сумма;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;  
		Движение.Содержание = "Поступление денежных средств";
		
	КонецЦикла;
	
	Если ОсталосьПогасить > 0 Тогда 
		Движение = Движения.Взаиморасчеты.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент; 
		Движение.Накладная = ПредопределенноеЗначение("Документ.РасходнаяНакладная.ПустаяСсылка"); 
		Движение.Сумма = ОсталосьПогасить; 
	КонецЕсли;
	
КонецПроцедуры

