
Процедура ОбработкаПроведения(Отказ, Режим) 
	
	// регистр Остатки Приход
	Движения.Остатки.Записывать = Истина; 
	
	// при отсутствии табличных частей, документ не проводим
	Если Товар.Количество() = 0 Тогда		
		Сообщить("Не заполнена табличная часть");
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
	
	// сворачиваем по общей номенклатуре в регистр	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходнаяНакладнаяТовар.Товар КАК Товар,
	               |	СУММА(ПриходнаяНакладнаяТовар.Количество) КАК Количество,
	               |	СУММА(ПриходнаяНакладнаяТовар.Сумма) КАК Сумма,
	               |	ПриходнаяНакладная.Склад КАК Склад
	               |ИЗ
	               |	Документ.ПриходнаяНакладная.Товар КАК ПриходнаяНакладнаяТовар
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	               |		ПО ПриходнаяНакладнаяТовар.Ссылка = ПриходнаяНакладная.Ссылка
	               |ГДЕ
	               |	ПриходнаяНакладнаяТовар.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПриходнаяНакладнаяТовар.Товар,
	               |	ПриходнаяНакладная.Склад";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	// формируем записи в регистр Остатки Приход
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ВыборкаДетальныеЗаписи.Товар; 
		Движение.Склад = ВыборкаДетальныеЗаписи.Склад;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;		
	КонецЦикла;
		
	ОбработкаПроведенияПоРегиструВзаиморасчеты(Отказ, Режим);
	
	ОбработкаПроведенияПоРегиструЦенаЗакуп(Отказ, Режим);
	
	ОбработкаПроведенияПоРегиструУправленческий(Отказ, Режим)
	
КонецПроцедуры


Процедура ОбработкаПроведенияПоРегиструВзаиморасчеты(Отказ, Режим)

	// регистр Взаиморасчеты Расход
	Движения.Взаиморасчеты.Записывать = Истина;
	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Сумма = Товар.Итог("Сумма") + Услуга.Итог("Сумма");

КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// для автоматического заполнения реквизита СуммаПоДокументу
	СуммаТЧТовар = 0;
	Для Каждого СтрТабЧасти Из Товар Цикл
		СуммаТЧТовар = СуммаТЧТовар + СтрТабЧасти.Сумма;
	КонецЦикла;
	
	СуммаТЧУслуга = 0;
	Для Каждого СтрТабЧасти Из Услуга Цикл 
		СуммаТЧУслуга = СуммаТЧУслуга + СтрТабЧасти.Сумма;		
	КонецЦикла;
	
	СуммаПоДокументу = СуммаТЧТовар + СуммаТЧУслуга;
	
КонецПроцедуры

Процедура ОбработкаПроведенияПоРегиструЦенаЗакуп(Отказ, Режим)

	// регистр СтоимостьТоваров Приход
	Движения.ЦенаЗакуп.Записывать = Истина;
	Для Каждого ТекСтрокаТовар Из Товар Цикл
		Движение = Движения.ЦенаЗакуп.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовар.Товар;
		Движение.ЦенаЗакуп = ТекСтрокаТовар.ЦенаЗакуп;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроведенияПоРегиструУправленческий(Отказ, Режим) 
	
     // Регистр бухгалтерии Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаТовар Из Товар Цикл
		Движение = Движения.Управленческий.Добавить();
		//Движение.СчетДт = ПланыСчетов.Основной.Товары;  
		Движение.СчетДт = ТекСтрокаТовар.СчетУчета;
		Движение.СчетКт = ПланыСчетов.Основной.РасчетыСПоставщиками; 
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТовар.Сумма;
		Движение.КоличествоДт = ТекСтрокаТовар.Количество;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.ТоварыИУслуги] = ТекСтрокаТовар.Товар; 
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент; 
		Движение.Содержание = "Поступление товаров";  
	КонецЦикла;
		
КонецПроцедуры