
Процедура ОбработкаПроведения(Отказ, Режим) 
	
	// регистр Остатки Приход
	Движения.Остатки.Записывать = Истина;     
	
	// при отсутствии табличных частей, документ не проводим
	Если Товар.Количество() = 0 Тогда		
		Сообщить("Не заполнена табличная часть");
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
	
	// сворачиваем по общей номенклатуре в регистр	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходнаяНакладнаяТовар.Товар КАК Товар,
	               |	СУММА(ПриходнаяНакладнаяТовар.Количество) КАК Количество,
	               |	СУММА(ПриходнаяНакладнаяТовар.Сумма) КАК Сумма
	               |ИЗ
	               |	Документ.ПриходнаяНакладная.Товар КАК ПриходнаяНакладнаяТовар
	               |ГДЕ
	               |	ПриходнаяНакладнаяТовар.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПриходнаяНакладнаяТовар.Товар";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	// формируем записи в регистр Остатки Приход
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ВыборкаДетальныеЗаписи.Товар;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
		
	ОбработкаПроведенияПоРегиструВзаиморасчеты(Отказ, Режим);
	
КонецПроцедуры


Процедура ОбработкаПроведенияПоРегиструВзаиморасчеты(Отказ, Режим)

	// регистр Взаиморасчеты Расход
	Движения.Взаиморасчеты.Записывать = Истина;
	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Сумма = Товар.Итог("Сумма") + Услуга.Итог("Сумма");

КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// для автоматического заполнения реквизита СуммаПоДокументу
	СуммаТЧТовар = 0;
	Для Каждого СтрТабЧасти Из Товар Цикл
		СуммаТЧТовар = СуммаТЧТовар + СтрТабЧасти.Сумма;
	КонецЦикла;
	
	СуммаТЧУслуга = 0;
	Для Каждого СтрТабЧасти Из Услуга Цикл 
		СуммаТЧУслуга = СуммаТЧУслуга + СтрТабЧасти.Сумма;		
	КонецЦикла;
	
	СуммаПоДокументу = СуммаТЧТовар + СуммаТЧУслуга;
	
КонецПроцедуры
