
Функция ПолучитьКредитныйЛимитКонтрагента(Дата, Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КредитныеЛимитыСрезПоследних.Контрагент КАК Контрагент,
	               |	КредитныеЛимитыСрезПоследних.Сумма КАК Сумма
	               |ИЗ
	               |	РегистрСведений.КредитныеЛимиты.СрезПоследних(&Дата, Контрагент = &Контрагент) КАК КредитныеЛимитыСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Сумма;
	Иначе
		Возврат 0;		
	КонецЕсли;;
		
КонецФункции 
 	
// данная функция так же приурочена к работе кредитного лимита
Функция ПолучитьЗадолженностьКонтрагента(Дата, Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыОстатки.Контрагент КАК Контрагент,
	               |	ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.Взаиморасчеты.Остатки(&Дата, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.СуммаОстаток;
	Иначе 
		Возврат 0;	
	КонецЕсли;;
				
КонецФункции

