  
Процедура РассчитатьСумму(СтрокаТабличнойЧасти) Экспорт   //  расчет суммы в документах
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена
	
КонецПроцедуры

Процедура РассчитатьСуммуЗакупа(СтрокаТабличнойЧасти) Экспорт   //  расчет суммы закупа в документах
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаЗакуп
	
КонецПроцедуры

Функция ПолучитьСчетУчетаНоменклатуры(Номенклатура) Экспорт
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетаУчетаНоменлатуры.Номенклатура КАК Номенклатура,
		|	СчетаУчетаНоменлатуры.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ТаблСчетов
		|ИЗ
		|	РегистрСведений.СчетаУчетаНоменлатуры КАК СчетаУчетаНоменлатуры
		|ГДЕ
		|	СчетаУчетаНоменлатуры.Номенклатура В(&МассивНоменклатура)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблСчетов.СчетУчета КАК СчетУчета
		|ИЗ
		|	ТаблСчетов КАК ТаблСчетов
		|ГДЕ
		|	ТаблСчетов.Номенклатура = &Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблСчетов.СчетУчета
		|ИЗ
		|	ТаблСчетов КАК ТаблСчетов
		|ГДЕ
		|	ТаблСчетов.Номенклатура = &ПустаяНоменклатура";
	
	МассивНоменклатуры = Новый Массив;
	МассивНоменклатуры.Добавить(ТоварыИУслуги);
	МассивНоменклатуры.Добавить(Справочники.ТоварыИУслуги.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("МассивНоменклатура", МассивНоменклатура);
	Запрос.УстановитьПараметр("ТоварыИУслуги", ТоварыИУслуги);
	Запрос.УстановитьПараметр("ПустаяНоменклатура", Справочники.ТоварыИУслуги.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецФункции