
&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	// для автоматического подставления суммы задолженности при выборе контрагента
	Отбор = Новый Структура();
	Отбор.Вставить("Контрагент", Объект.Контрагент);
	ОстаткиПоКонтрагенту = РегистрыНакопления.Взаиморасчеты.Остатки(КонецДня(Объект.Дата), Отбор);
	
	Если ОстаткиПоКонтрагенту.Количество() > 0 Тогда
		СтрокаТаблицы = ОстаткиПоКонтрагенту[0];
		ЗначениеКолонкиВСтроке = СтрокаТаблицы.Сумма;
		Объект.Сумма = ЗначениеКолонкиВСтроке; 
	Иначе 
		Объект.Сумма = 0;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры


